; ModuleID = '/tmp/__genmc.ll'
source_filename = "tr-caslock.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.__VERIFIER_inode = type { %struct.__VERIFIER_mutex_t, i32, i32, i32, [64 x i8] }
%struct.__VERIFIER_mutex_t = type { i32 }
%struct.__VERIFIER_file = type { %struct.inode*, i32, i32, %struct.__VERIFIER_mutex_t, i32 }
%struct.inode = type opaque
%struct._IO_FILE = type opaque
%struct.__VERIFIER_barrier_t = type { i32 }
%struct.__VERIFIER_attr_t = type { i32 }

@l = dso_local global i32 0, align 4, !dbg !0
@x = dso_local global i32 0, align 4, !dbg !18
@A = dso_local global [16 x i32] zeroinitializer, align 16, !dbg !21
@__genmc_dir_inode = dso_local addrspace(42) global %struct.__VERIFIER_inode zeroinitializer, align 4, !dbg !26
@__genmc_dummy_file = dso_local addrspace(42) global %struct.__VERIFIER_file zeroinitializer, align 8, !dbg !44
@errno = dso_local global i32 0, align 4, !dbg !55
@stdin = dso_local global %struct._IO_FILE* null, align 8, !dbg !58
@stdout = dso_local global %struct._IO_FILE* null, align 8, !dbg !63
@stderr = dso_local global %struct._IO_FILE* null, align 8, !dbg !65
@bard = dso_local global %struct.__VERIFIER_barrier_t zeroinitializer, align 4, !dbg !67
@barg = dso_local global [5 x %struct.__VERIFIER_barrier_t] zeroinitializer, align 16, !dbg !75

; Function Attrs: noinline nounwind uwtable

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "l", scope: !2, file: !3, line: 61, type: !80, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !15, globals: !17, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "tr-caslock.c", directory: "/home/lab/Downloads/tools/gpuMem-race-detection/input/dat3m/opencl", checksumkind: CSK_MD5, checksum: "3b4122db381e89e91b52d61953ebc65d")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "memory_order", file: !6, line: 61, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "include/stdatomic.h", directory: "/home/lab/Downloads/tools/gpuMem-race-detection", checksumkind: CSK_MD5, checksum: "e0b50d9064c5b4d5d741a8c16fbfd08e")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14}
!9 = !DIEnumerator(name: "memory_order_relaxed", value: 0)
!10 = !DIEnumerator(name: "memory_order_consume", value: 1)
!11 = !DIEnumerator(name: "memory_order_acquire", value: 2)
!12 = !DIEnumerator(name: "memory_order_release", value: 3)
!13 = !DIEnumerator(name: "memory_order_acq_rel", value: 4)
!14 = !DIEnumerator(name: "memory_order_seq_cst", value: 5)
!15 = !{!16}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!17 = !{!0, !18, !21, !26, !44, !55, !58, !63, !65, !67, !75}
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "x", scope: !2, file: !3, line: 62, type: !20, isLocal: false, isDefinition: true)
!20 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "A", scope: !2, file: !3, line: 63, type: !23, isLocal: false, isDefinition: true)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 512, elements: !24)
!24 = !{!25}
!25 = !DISubrange(count: 16)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "__genmc_dir_inode", scope: !2, file: !28, line: 61, type: !29, isLocal: false, isDefinition: true)
!28 = !DIFile(filename: "include/genmc_internal.h", directory: "/home/lab/Downloads/tools/gpuMem-race-detection", checksumkind: CSK_MD5, checksum: "a7523a76bd0c424a519d1324fcdcc39c")
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__VERIFIER_inode", file: !28, line: 38, size: 640, elements: !30)
!30 = !{!31, !36, !37, !38, !39}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !29, file: !28, line: 40, baseType: !32, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__VERIFIER_mutex_t", file: !28, line: 23, baseType: !33)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !28, line: 23, size: 32, elements: !34)
!34 = !{!35}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__private", scope: !33, file: !28, line: 23, baseType: !20, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "i_size", scope: !29, file: !28, line: 41, baseType: !20, size: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "i_transaction", scope: !29, file: !28, line: 44, baseType: !20, size: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "i_disksize", scope: !29, file: !28, line: 49, baseType: !20, size: 32, offset: 96)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !29, file: !28, line: 50, baseType: !40, size: 512, offset: 128)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 512, elements: !42)
!41 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!42 = !{!43}
!43 = !DISubrange(count: 64)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "__genmc_dummy_file", scope: !2, file: !28, line: 62, type: !46, isLocal: false, isDefinition: true)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__VERIFIER_file", file: !28, line: 53, size: 192, elements: !47)
!47 = !{!48, !51, !52, !53, !54}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "inode", scope: !46, file: !28, line: 54, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !28, line: 54, flags: DIFlagFwdDecl)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !46, file: !28, line: 55, baseType: !7, size: 32, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !46, file: !28, line: 56, baseType: !7, size: 32, offset: 96)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "pos_lock", scope: !46, file: !28, line: 57, baseType: !32, size: 32, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !46, file: !28, line: 58, baseType: !20, size: 32, offset: 160)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "errno", scope: !2, file: !57, line: 126, type: !20, isLocal: false, isDefinition: true)
!57 = !DIFile(filename: "include/errno.h", directory: "/home/lab/Downloads/tools/gpuMem-race-detection", checksumkind: CSK_MD5, checksum: "91e118040a3ab163aa96d3c3451866a3")
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "stdin", scope: !2, file: !60, line: 15, type: !61, isLocal: false, isDefinition: true)
!60 = !DIFile(filename: "include/stdio.h", directory: "/home/lab/Downloads/tools/gpuMem-race-detection", checksumkind: CSK_MD5, checksum: "0edd8f8afe87cbce24b4902f9dfb5d68")
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !60, line: 12, flags: DIFlagFwdDecl)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "stdout", scope: !2, file: !60, line: 16, type: !61, isLocal: false, isDefinition: true)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "stderr", scope: !2, file: !60, line: 17, type: !61, isLocal: false, isDefinition: true)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "bard", scope: !2, file: !3, line: 41, type: !69, isLocal: false, isDefinition: true)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_barrier_t", file: !70, line: 33, baseType: !71)
!70 = !DIFile(filename: "include/pthread.h", directory: "/home/lab/Downloads/tools/gpuMem-race-detection", checksumkind: CSK_MD5, checksum: "abcaa9781d7384cead920ebd1c959602")
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__VERIFIER_barrier_t", file: !28, line: 20, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !28, line: 20, size: 32, elements: !73)
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__private", scope: !72, file: !28, line: 20, baseType: !20, size: 32)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "barg", scope: !2, file: !3, line: 42, type: !77, isLocal: false, isDefinition: true)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 160, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 5)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_int", file: !6, line: 97, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_atomic_type, baseType: !20)
!82 = !{i32 7, !"Dwarf Version", i32 5}
!83 = !{i32 2, !"Debug Info Version", i32 3}
!84 = !{i32 1, !"wchar_size", i32 4}
!85 = !{i32 7, !"PIC Level", i32 2}
!86 = !{i32 7, !"PIE Level", i32 2}
!87 = !{i32 7, !"uwtable", i32 1}
!88 = !{i32 7, !"frame-pointer", i32 2}
!89 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!90 = distinct !DISubprogram(name: "mutex_test", scope: !3, file: !3, line: 86, type: !91, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !93)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !20, !20, !20, !20}
!93 = !{}
!94 = !DILocation(line: 93, column: 7, scope: !90)
!95 = !DILocation(line: 95, column: 6, scope: !90)
!96 = !DILocation(line: 95, column: 13, scope: !90)
!97 = !DILocation(line: 95, column: 82, scope: !90)
!98 = distinct !{!98, !95, !99, !100}
!99 = !DILocation(line: 97, column: 5, scope: !90)
!100 = !{!"llvm.loop.mustprogress"}
!101 = !DILocation(line: 98, column: 5, scope: !90)
!102 = !DILocation(line: 99, column: 9, scope: !90)
!103 = !DILocation(line: 100, column: 5, scope: !90)
!104 = !DILocation(line: 101, column: 11, scope: !90)
!105 = !DILocation(line: 101, column: 7, scope: !90)
!106 = !DILocation(line: 106, column: 7, scope: !90)
!107 = !DILocation(line: 108, column: 5, scope: !90)
